<template>
  <div class="tips-box">
    <a-collapse :default-active-key="['1', '4']">
      <a-collapse-item header="1. 注册协议条款的确认和接受" key="1">
        <p>当您【注册】/【登录】并开始使用本站，您的使用行为将被视为对本声明协议全部内容的认可。</p>
        <p>本《协议》可由本站定期更新,更新后的协议条款一旦公布即代替原来的协议条款,恕不再另行通知,</p>
        <p>用户可在本站查阅最新版协议条款。在本站修改《协议》条款后,如果用户不接受修改后的条款,</p>
        <p>请立即停止使用本站提供的网络服务,继续使用的用户将被视为已接受了修改后的协议。</p>
      </a-collapse-item>
      <a-collapse-item header="2. 注册协议条款的确认和接受" key="2">
        <p>1.本站承诺尽可能的为您提供稳定高效的服务体验,如您在使用过程中遇到问题请及时与我们联系,我们会尽力为您解决。</p>
        <p>2.如第三方网站维护/无法正常访问/关闭等，我们将及时发布公告进行通知！</p>
        <p>3.如果以下情况，我们将不做补偿：</p>
        <p>打开两个页面同时下载两张或两张以上相同的文件。</p>
        <p>非正常操作，双击或多次点击确认下载按钮等。</p>
        <p>由作者上传文件或第三方服务器崩溃的错误。</p>
        <p>下载过程中强制刷新页面，导致下载失败。</p>
        <p>您的浏览器奔溃/错误，程序错误等。</p>
        <p>错误的互联网连接问题。</p>
      </a-collapse-item>
      <a-collapse-item header="3. 用户帐号" key="3">
        <p>1.经本站注册系统完成注册程序并通过身份认证的用户即为正式用户。</p>
        <p>2.如发现用户帐号中含有不雅文字或不恰当名称的,本站保留注销其用户帐号的权利。</p>
        <p>3.用户帐号的所有权归本站,用户完成申请注册手续后,用户享有使用权。3个月未使用的用户账号,本站保留收回的权利。</p>
        <p>4.用户有义务保证密码和帐号的安全,用户利用该帐号所进行的一切活动引起的任何损失或损害,由用户自行承担全部责任,</p>
        <p>本站不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题,应立即修改账号密码并妥善保管。</p>
        <p>因黑客行为或用户的保管疏忽导致帐号非法使用,本站不承担任何责任。</p>
      </a-collapse-item>
      <a-collapse-item header="4. 版权及免责声明" key="4">
        <p>本网站支持的资源代下载及视频网站观看原理是本站通过对网友提供的网站会员号统一管理共享调度从而实现的，</p>
        <p>并非对该类网站的VIP机制破解绕过等违法操作实现的，如网友提供的会员号违反了该类网站相关的注册使用约定，</p>
        <p>本网站不承担任何法律及法律以外的责任,用户使用前应当注意,本站代下的所有文件,仅供个人编辑使用不可传播,</p>
        <p style="color: red;">不可以商用，引起版权及其他纠纷由使用者自行承担，如需商用请用户自行前往版权所在网站购买使用。</p>
      </a-collapse-item>
      <a-collapse-item header="5. 协议的用途、更新和效力" key="5">
        <p>鉴于国家法律法规不时变化及本站运营之需要，本站有权对本协议条款不时地进行修改，</p>
        <p>修改后的协议一旦被公布于本站上即告生效，并替代原来的协议。</p>
        <p>用户有义务不时关注并阅读最新版的协议及网站公告。</p>
        <p>如用户不同意更新后的协议，则应立即停止接受本站依据本协议提供的服务；</p>
        <p>若用户继续使用本站提供的服务的，即视为同意更新后的协议。</p>
        <p>如果本协议中任何一条被视为废止、无效或因任何理由不可执行，</p>
        <p>该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>
      </a-collapse-item>
    </a-collapse>
  </div>
</template>
<style lang="less" scoped>
.tips-box {
  width: 74%;
  margin: 30px auto;
}
p{
  margin: 10px 0;
}
</style>